#include "out.h"

int out_menu() {
  system("cls");
  printf("***********************************************************\n");
  printf("*|||||||||||||||||||||||||||||||||||||||||||||||||||||||||*\n");
  printf("*||||||||||||||||||||||START GAME(1)||||||||||||||||||||||*\n");
  printf("*|||||||||||||||||||||||||||||||||||||||||||||||||||||||||*\n");
  printf("*||||||||||||||||||||||RULES PAGE(2)||||||||||||||||||||||*\n");
  printf("*|||||||||||||||||||||||||||||||||||||||||||||||||||||||||*\n");
  printf("*||||||||||||||||||||||EXIT GAME|(3)||||||||||||||||||||||*\n");
  printf("*|||||||||||||||||||||||||||||||||||||||||||||||||||||||||*\n");
  printf("***********************************************************\n");
  int answer = 0;
  scanf("%d", &answer);
  while (answer != 1 && answer != 2 && answer != 3) {
    printf("input error. try again.\n");
    scanf("%d", &answer);
    printf("%d", answer);
  }
  if (answer == 1 && answer == 2 && answer == 3)
    return answer;
}

int rules_page() {
  system("cls");
  printf("*************************************************************\n");
  printf("*|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||*\n");
  printf("*Участие принимает два игрока, соревнуясь друг против друга.*\n");
  printf("*Или игрок против интеллекта компьютера. Перед ними на столе*\n");
  printf("*в ряд выложено 100 спичек. Каждый в свой ход может взять от*\n");
  printf("*1 до 10 спичек. Ходы выполняются по очереди. Проигрывает   *\n");
  printf("*участник, взявший последнюю спичку (или спички).           *\n");
  printf("*|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||*\n");
  printf("*************************************************************\n");
  printf("Back - enter 1\n");
  int answer = 0;
  scanf("%d", &answer);
  while (answer != 1) {
    printf("Back - enter 1\n");
    scanf("%d", &answer);
  }
  if (answer == 1)
    return 0;
}

int start_game_out() {
  system("cls");
  printf("*************************************************************\n");
  printf("*|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||*\n");
  printf("*||||||||||||||||||||||||START GAME|||||||||||||||||||||||||*\n");
  printf("*|||||||||||||||||||||||||||||||||||||||||||||||||||||||||||*\n");
  printf("*************************************************************\n");
  printf("выберите режим игры:\n");
  int answer = 0;
  char ans[1];
  //по какой-то причине дважды срабатывает
  while (answer != 1 && answer != 2) {
    printf("1 - игрок против игрока\n2 - игрок против компьютера\n");
    scanf("%c", &ans);
    answer = atoi(ans);
  }
  if (answer == 1 && answer == 2)
    return answer;
}
